toy_app/app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", ""], ["email", ""], ["updated_at", "2020-01-29 20:21:36.169662"], ["id", 1]]